app/controllers/centers_controller.rb

  def index
    @centers = ServiceProvider.all
---
SELECT "service_providers".* FROM "service_providers"

  def show
    @center = ServiceProvider.find(params[:id])
---
SELECT  "service_providers".* FROM "service_providers" WHERE "service_providers"."id" = $1 LIMIT 1  [["id", 1]]