app/controllers/flags_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "flags" WHERE "flags"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT "flags".* FROM "flags" WHERE "flags"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:user_id])
    @flags = @user.flags
    unless @flags.empty?

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "flags" ("user_id", "flaggable_id", "flaggable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["flaggable_id", 2], ["flaggable_type", "Post"], ["created_at", "2016-06-07 22:46:31.357370"], ["updated_at", "2016-06-07 22:46:31.357370"]]
---
  def create
    if params[:flaggable_type]
      item = params[:flaggable_type]
    else
      item = ''
    end

    if item.downcase == 'post'
      flaggable = Post.find(params[:flaggable])
    else
      flaggable = Comment.find(params[:flaggable])
    end

    @flag = Flag.new(user_id: params[:user_id].to_i, flaggable: flaggable, flaggable_type: params[:flaggable_type].capitalize)
    if @flag.save