app/controllers/posts_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @school = School.find(params[:school_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    p "$&#@" * 50
    p params
    p "$&#@" * 50
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.destroy