app/controllers/schools_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @school = School.find(params[:id])